In [18]:
import numpy as np
import pandas as pd

In [19]:
my = {'A':[2,8,6],'B':[12,np.nan,6],'C':[5,np.nan,np.nan]}

In [20]:
df = pd.DataFrame(my)

In [21]:
df

   A     B    C
0  2  12.0  5.0
1  8   NaN  NaN
2  6   6.0  NaN

In [22]:
df.dropna()

   A     B    C
0  2  12.0  5.0

In [23]:
df.dropna(axis=1)

   A
0  2
1  8
2  6

In [24]:
df.dropna(thresh=2)

   A     B    C
0  2  12.0  5.0
2  6   6.0  NaN

In [25]:
df.dropna(axis=1,thresh=2)

   A     B
0  2  12.0
1  8   NaN
2  6   6.0

In [34]:
df.isnull().sum()

A    0
B    1
C    0
dtype: int64

In [35]:
df

   A     B    C
0  2  12.0  5.0
1  8   NaN  5.0
2  6   6.0  5.0

In [26]:
df.fillna(value='ramesh')

   A       B       C
0  2      12       5
1  8  ramesh  ramesh
2  6       6  ramesh

In [27]:
df

   A     B    C
0  2  12.0  5.0
1  8   NaN  NaN
2  6   6.0  NaN

In [28]:
df['B'].fillna(value=df['B'].mean())

0    12.0
1     9.0
2     6.0
Name: B, dtype: float64

In [29]:
k =df['C'].mean()

In [30]:
k

5.0

In [31]:
df['C'].fillna(value=k,inplace = True)

In [32]:
df

   A     B    C
0  2  12.0  5.0
1  8   NaN  5.0
2  6   6.0  5.0